# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [164]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [372]:
for i in range(0, 10):
    data_info = pd.read_csv(
        r'C:\Users\kzolo\OneDrive\Documents\GitHub\DPO_ML_Autumn2021\Занятие 1\Data\Students_info_{0}.csv'.format(i))
    data_marks = pd.read_csv(
        r'C:\Users\kzolo\OneDrive\Documents\GitHub\DPO_ML_Autumn2021\Занятие 1\Data\Students_marks_{0}.csv'.format(i))
    df_test = data_info.merge(data_marks, how='left')
    if i == 0:
        df = df_test
    else:
        df = pd.concat([df, df_test], axis=0, ignore_index=True)

In [373]:
df.tail(10)

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
990,990,male,group E,high school,free/reduced,completed,group10,86,81,75
991,991,female,group B,some high school,standard,completed,group10,65,82,78
992,992,female,group D,associate's degree,free/reduced,none,group10,55,76,76
993,993,female,group D,bachelor's degree,free/reduced,none,group10,62,72,74
994,994,male,group A,high school,standard,none,group10,63,63,62
995,995,female,group E,master's degree,standard,completed,group10,88,99,95
996,996,male,group C,high school,free/reduced,none,group10,62,55,55
997,997,female,group C,high school,free/reduced,completed,group10,59,71,65
998,998,female,group D,some college,standard,completed,group10,68,78,77
999,999,female,group D,some college,free/reduced,none,group10,77,86,86

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [374]:
df.drop(columns='index', inplace=True)

In [375]:
df.head(10)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

#### Задание 3. Выведите на экран размеры полученной таблицы

In [376]:
df.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [377]:
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [378]:
df.isnull().sum()

gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
math score                     0
reading score                  0
writing score                  0
dtype: int64

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [380]:
df.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [381]:
import numpy as np
grouped = pd.pivot_table(df, index=['test preparation course'], aggfunc=np.mean)
grouped

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [382]:
df['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [383]:
df.rename(columns={"parental level of education": "education",
                   "test preparation course": "test preparation"}, inplace=True)

In [384]:
df.head(10)

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,72,72,74
1,female,group C,some college,standard,completed,group1,69,90,88
2,female,group B,master's degree,standard,none,group1,90,95,93
3,male,group A,associate's degree,free/reduced,none,group1,47,57,44
4,male,group C,some college,standard,none,group1,76,78,75
5,female,group B,associate's degree,standard,none,group1,71,83,78
6,female,group B,some college,standard,completed,group1,88,95,92
7,male,group B,some college,free/reduced,none,group1,40,43,39
8,male,group D,high school,free/reduced,completed,group1,64,64,67
9,female,group B,high school,free/reduced,none,group1,38,60,50

**Зафиксируем минимальный балл для сдачи экзамена**

In [178]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [180]:
len(df[df['math score'] > passmark])/len(df.index)

0.85

In [389]:
len(df[(df['math score'] > passmark)&(df['test preparation'] == 'completed')])/len(df[df['test preparation'] == "completed"])

0.9078212290502793

In [395]:
len(df[(df['gender'] == 'female')&(df['test preparation'] == 'none')&(df['math score'] < passmark)])/len(df[df['gender'] == 'female'])

0.13513513513513514

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [415]:
df.groupby("race/ethnicity")['reading score'].mean()

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [416]:
df.groupby("education")['writing score'].min()

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [417]:
group_A, group_B, group_C, group_D, group_E = 0, 0, 0, 0, 0
group_A_score, group_B_score, group_C_score, group_D_score, group_E_score = 0, 0, 0, 0, 0
for i in range(0, len(df.index)):
    if df.iloc[i]['race/ethnicity'] == 'group A':
        group_A += 1
        group_A_score += df.iloc[i]['reading score']
    elif df.iloc[i]['race/ethnicity'] == 'group B':
        group_B += 1
        group_B_score += df.iloc[i]['reading score']
    elif df.iloc[i]['race/ethnicity'] == 'group C':
        group_C += 1
        group_C_score += df.iloc[i]['reading score']
    elif df.iloc[i]['race/ethnicity'] == 'group D':
        group_D += 1
        group_D_score += df.iloc[i]['reading score']
    elif df.iloc[i]['race/ethnicity'] == 'group E':
        group_E += 1
        group_E_score += df.iloc[i]['reading score']
print(f"Group A средний балл за экзамен по чтению {group_A_score/group_A}")
print(f"Group B средний балл за экзамен по чтению {group_B_score/group_B}")
print(f"Group C средний балл за экзамен по чтению {group_C_score/group_C}")
print(f"Group D средний балл за экзамен по чтению {group_D_score/group_D}")
print(f"Group E средний балл за экзамен по чтению {group_E_score/group_E}")

Group A средний балл за экзамен по чтению 64.67415730337079
Group B средний балл за экзамен по чтению 67.35263157894737
Group C средний балл за экзамен по чтению 69.10344827586206
Group D средний балл за экзамен по чтению 70.03053435114504
Group E средний балл за экзамен по чтению 73.02857142857142

In [418]:
import collections
c = collections.Counter()
for i in range(0, len(df.index)):
    c[df.iloc[i]['education']] += 1
lists = [[] for i in range(len(c))]
k = 0
for key in c:
    for index, row in df[df['education'] == key].iterrows():
        lists[k].append(df['writing score'].values[index])
    print(key, min(lists[k]))
    k += 1

bachelor's degree 38
some college 19
master's degree 46
associate's degree 35
high school 15
some high school 10

дичь, я эти циклы писала дольше чем всю домашку делала))

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [419]:
import numpy as np
grouped = pd.pivot_table(df, index=['education', 'gender'], aggfunc=np.mean)
grouped

                           math score  reading score  writing score
education          gender
associate's degree female   65.250000      74.120690      74.000000
                   male     70.764151      67.433962      65.405660
bachelor's degree  female   68.349206      77.285714      78.380952
                   male     70.581818      68.090909      67.654545
high school        female   59.351064      68.202128      66.691489
                   male     64.705882      61.480392      58.539216
master's degree    female   66.500000      76.805556      77.638889
                   male     74.826087      73.130435      72.608696
some college       female   65.406780      73.550847      74.050847
                   male     69.009259      64.990741      63.148148
some high school   female   59.296703      69.109890      68.285714
                   male     67.840909      64.693182      61.375000

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [420]:
df['Math_PassStatus'] = df['math score'].apply(
    lambda x: 'F' if x < passmark else 'P')
df['Reading_PassStatus'] = df['reading score'].apply(
    lambda x: 'F' if x < passmark else 'P')
df['Writing_PassStatus'] = df['writing score'].apply(
    lambda x: 'F' if x < passmark else 'P')
print(df['Math_PassStatus'].value_counts())
print(df['Reading_PassStatus'].value_counts())
print(df['Writing_PassStatus'].value_counts())

P    865
F    135
Name: Math_PassStatus, dtype: int64
P    910
F     90
Name: Reading_PassStatus, dtype: int64
P    886
F    114
Name: Writing_PassStatus, dtype: int64

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [421]:
df['OverAll_PassStatus'] = df.apply(lambda x: 'P' if x['Math_PassStatus']+x['Reading_PassStatus']+x['Writing_PassStatus']=='PPP' else 'F', axis = 1)

In [345]:
len(df[df['OverAll_PassStatus']=='P'])

812

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####      [90;100] = A
####      [80;90) = B
####      [70;80) = C
####      [60;70) = D
####      [50;60) = E
####      [0;50) = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [422]:
def GetGrade(average_mark):
    if average_mark in range (90,101):
        return 'A'
    elif average_mark in range (80,90):
        return 'B'
    elif average_mark in range (70,80):
        return 'C'
    elif average_mark in range (60,70):
        return 'D'
    elif average_mark in range (50,60):
        return 'E'
    elif average_mark in range (0,50):
        return 'F'
    
cols = ['math score', 'reading score', 'writing score']
df['average'] = df[cols].mean(axis=1)
df['Grade'] = df['average'].apply(lambda x: GetGrade(int(x)))

In [423]:
df.groupby(['Grade']).size()

Grade
A     52
B    146
C    261
D    256
E    182
F    103
dtype: int64